tutorials/multiphase/multiphaseInterFoam/laminar/damBreak4phase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( water { transportModel Newtonian ; nu nu [ 0 2 -1 0 0 0 0 ] 1e-06 ; rho rho [ 1 -3 0 0 0 0 0 ] 1000 ; } oil { transportModel Newtonian ; nu nu [ 0 2 -1 0 0 0 0 ] 1e-06 ; rho rho [ 1 -3 0 0 0 0 0 ] 500 ; } mercury { transportModel Newtonian ; nu nu [ 0 2 -1 0 0 0 0 ] 1.125e-07 ; rho rho [ 1 -3 0 0 0 0 0 ] 13529 ; } air { transportModel Newtonian ; nu nu [ 0 2 -1 0 0 0 0 ] 1.48e-05 ; rho rho [ 1 -3 0 0 0 0 0 ] 1 ; } );

refPhase        air;

sigmas          ( ( air water ) 0.07 ( air oil ) 0.07 ( air mercury ) 0.07 ( water oil ) 0.07 ( water mercury ) 0.07 ( oil mercury ) 0.07 );

// ************************************************************************* //
